In [1]:
import pandas as pd
import usermodule

In [2]:
df = pd.read_csv("D:/code/pythonChrist/lab1/user-table.csv")

In [3]:
df

      name        username        password                 email       phone
0  vaibhav  vaibhav2447157  newpassword123  newemail@example.com  1234567890

In [4]:
df = usermodule.adduser("karthik", "karthikd", "karthikd", "karthikd92@gmail.com", 9731463868, df)
print(df)

      name        username        password                 email       phone
0  vaibhav  vaibhav2447157  newpassword123  newemail@example.com  1234567890
1  karthik        karthikd        karthikd  karthikd92@gmail.com  9731463868

In [5]:
df.to_csv("D:/code/pythonChrist/lab1/user-table.csv", index=False)

In [6]:
df = pd.read_csv("D:/code/pythonChrist/lab1/user-table.csv")
df = usermodule.deleteUser("username","karthikd",df)
print(df)
df.to_csv("D:/code/pythonChrist/lab1/user-table.csv", index=False)

      name        username        password                 email       phone
0  vaibhav  vaibhav2447157  newpassword123  newemail@example.com  1234567890

In [7]:
df = usermodule.adduser("karthik", "karthikd", "karthikd", "karthikd92@gmail.com", 9731463868, df)
df.to_csv("D:/code/pythonChrist/lab1/user-table.csv", index=False)

In [8]:
df = usermodule.update_user_info(df,  'vaibhav2447157', 'newpassword123', '1234567890', 'newemail@example.com' )

In [9]:
df.to_csv("D:/code/pythonChrist/lab1/user-table.csv", index=False)

In [10]:
df = pd.read_csv("D:/code/pythonChrist/lab1/user-table.csv")

In [11]:
df

      name        username        password                 email       phone
0  vaibhav  vaibhav2447157  newpassword123  newemail@example.com  1234567890
1  karthik        karthikd        karthikd  karthikd92@gmail.com  9731463868

In [12]:
import menuModule

In [13]:
df = pd.read_csv("D:/code/pythonChrist/lab1/menu-item.csv")
df

  menu_code company_code     item_name        diet  price_rs  quantity_gram
0    CHRIST         VAIB  rajma chawal  vegetarian     266.2            500

In [14]:
df = menuModule.add_menu_item(df, 'CHRIST', 'VAIB', 'paneer tikka', 'vegetarian', 250, 300)
df

  menu_code company_code     item_name        diet  price_rs  quantity_gram
0    CHRIST         VAIB  rajma chawal  vegetarian     266.2            500
1    CHRIST         VAIB  paneer tikka  vegetarian     250.0            300

In [15]:
df.to_csv("D:/code/pythonChrist/lab1/menu-item.csv", index=False)

In [16]:
df = menuModule.delete_menu_item(df, 'CHRIST', 'VAIB', 'paneer tikka')
df

  menu_code company_code     item_name        diet  price_rs  quantity_gram
0    CHRIST         VAIB  rajma chawal  vegetarian     266.2            500

In [17]:
df.to_csv("D:/code/pythonChrist/lab1/menu-item.csv", index=False)

In [18]:
df = menuModule.increase_price(df, 'CHRIST', 'VAIB', 10)
df

  menu_code company_code     item_name        diet  price_rs  quantity_gram
0    CHRIST         VAIB  rajma chawal  vegetarian    292.82            500

In [19]:
df.to_csv("D:/code/pythonChrist/lab1/menu-item.csv", index=False)

In [20]:
df = menuModule.add_menu_item(df, 'CHRIST', 'VAIB', 'paneer tikka', 'vegetarian', 250, 300)
df.to_csv("D:/code/pythonChrist/lab1/menu-item.csv", index=False)

In [21]:
menu_items = menuModule.get_menu_items(df, 'CHRIST', 'VAIB')
print(menu_items)

  menu_code company_code     item_name        diet  price_rs  quantity_gram
0    CHRIST         VAIB  rajma chawal  vegetarian    292.82            500
1    CHRIST         VAIB  paneer tikka  vegetarian    250.00            300

In [22]:
df = menuModule.update_diet_type(df, 'CHRIST', 'VAIB', 'paneer tikka', 'non-vegetarian')

In [23]:
df.to_csv("D:/code/pythonChrist/lab1/menu-item.csv", index=False)

In [24]:
import employeeModule

In [25]:
employee_df = pd.read_csv("D:/code/pythonChrist/lab1/employee-table.csv")
employee_df

  company_code        username   role  adhaar_no     pan_no
0         VAIB  vaibhav2447157  clerk   24325462  CROPT2325

In [26]:
employee_df = employeeModule.add_employee(employee_df, 'VAIB', 'Yaash', 'manager', '12345678', 'ABCDE1234F')
employee_df

  company_code        username     role adhaar_no      pan_no
0         VAIB  vaibhav2447157    clerk  24325462   CROPT2325
1         VAIB           Yaash  manager  12345678  ABCDE1234F

In [27]:
employee_df = employeeModule.delete_employee(employee_df, 'VAIB', 'Yaash')

In [28]:
employee_df

  company_code        username   role adhaar_no     pan_no
0         VAIB  vaibhav2447157  clerk  24325462  CROPT2325

In [29]:
employee_df = employeeModule.add_employee(employee_df, 'VAIB', 'Yaash', 'manager', '12345678', 'ABCDE1234F')
employee_df

  company_code        username     role adhaar_no      pan_no
0         VAIB  vaibhav2447157    clerk  24325462   CROPT2325
1         VAIB           Yaash  manager  12345678  ABCDE1234F

In [30]:
employee_df = employeeModule.update_employee_role(employee_df, 'VAIB', 'Yaash', 'senior manager')

In [31]:
employee_df

  company_code        username            role adhaar_no      pan_no
0         VAIB  vaibhav2447157           clerk  24325462   CROPT2325
1         VAIB           Yaash  senior manager  12345678  ABCDE1234F

In [32]:
employees = employeeModule.get_employees(employee_df, 'VAIB')

In [33]:
employees

  company_code        username            role adhaar_no      pan_no
0         VAIB  vaibhav2447157           clerk  24325462   CROPT2325
1         VAIB           Yaash  senior manager  12345678  ABCDE1234F

In [34]:
employee_df.to_csv("D:/code/pythonChrist/lab1/employee-table.csv", index=False)